trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
	
	Если РольДоступна("МенеджерТорговогоЗала") Тогда
		ПараметрыВыбораМенеджера = Новый Массив;
		ПараметрыВыбораМенеджера.Добавить(Новый ПараметрВыбора("Отбор.ДоступностьДляМенеджераТорговогоЗала", Истина));
		Элементы.ПричинаБлокировки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМенеджера);	
	КонецЕсли;
	
КонецПроцедуры  

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды     

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Склад"" не заполнено'"), Объект.Ссылка, "Объект.СкладОтправитель");
		Возврат;	
	КонецЕсли;
	
	ОткрытьПодборТоваров();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьПодборТоваров()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад",                                     Объект.Склад);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",         Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",                    Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",           Истина);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры",                   Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь)));
	ПараметрыФормы.Вставить("Заголовок",                                 НСтр("ru = 'Подбор товаров'"));
	ПараметрыФормы.Вставить("Дата",                                      Объект.Дата);
	ПараметрыФормы.Вставить("Документ",                                  Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий",                    ПараметрыУказанияСерий);
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Перем ВыполняемаяОперация;
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)

	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();  
	
	ОбрабатываемыеСтроки = Новый Массив(); 

	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл	
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "Номенклатура, Характеристика, ХарактеристикиИспользуются, Упаковка, КоличествоУпаковок");
		//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); //После проверки новой обработки строк удалить
		ОбрабатываемыеСтроки.Добавить(ТекущаяСтрока);
	КонецЦикла;  
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Товары,
		КэшированныеЗначения); 
КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий)
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ИзменитьВидимость();
КонецПроцедуры
  
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

Процедура ИзменитьВидимость()
	ВидимостьДляРазблокировки = РольДоступна("ПодтверждениеОтделомКачества") И Объект.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
	Элементы.ИзменитьПричинуБлокировки.Видимость = ВидимостьДляРазблокировки;
КонецПроцедуры

&НаСервере
Процедура РазблокироватьНаСервере()
	
	Если Объект.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда
		
 		ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	
		Запрос = ДокументОбъект.ПолучитьКоличествоДляРазблокировки(Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 0 Тогда
			
			НачатьТранзакцию();

			Попытка
				СсылкаНаТекДок = Объект.Ссылка;

				ДокументРазблокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
				ДокументРазблокировки.Дата = ТекущаяДата();
				ДокументРазблокировки.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано;
				ДокументРазблокировки.БлокировкаОснование = СсылкаНаТекДок;
				ДокументРазблокировки.ДокументОснование = Объект.ДокументОснование;
				ДокументРазблокировки.Комментарий = "Разблокирован документ - " + Строка(Объект.Ссылка);
				ДокументРазблокировки.Ответственный = Пользователи.ТекущийПользователь();
				
				ДокументРазблокировки.Склад = СсылкаНаТекДок.Склад;
				ДокументРазблокировки.ПричинаБлокировки = СсылкаНаТекДок.ПричинаБлокировки;
				
				Пока Выборка.Следующий() Цикл
					Строка = ДокументРазблокировки.Товары.Добавить();
					Строка.Номенклатура = Выборка.Номенклатура;
					Строка.Характеристика = Выборка.Характеристика;
					Строка.Упаковка = Выборка.Упаковка;
					Строка.КоличествоУпаковок = Выборка.ИтогоКоличество;
				КонецЦикла;
				
				ДокументРазблокировки.Записать(РежимЗаписиДокумента.Проведение);
				
				АльтерраОбщегоНазначения.СообщитьПользователю(ДокументРазблокировки.Ссылка, "Создан документ: " + ДокументРазблокировки.Ссылка);
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();		
				Сообщить("Ошибка при создании документа! " + ИнформацияОбОшибке().Описание);
			КонецПопытки;	
		Иначе
			Сообщить("Документ уже полностью разблокирован");
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Разблокировать(Команда)
	
	Если Объект.Проведен Тогда
		РазблокироватьНаСервере();
	Иначе
		Сообщить("Сначала необходимо провести документ!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КоличествоРазблокировки()

	Если Объект.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
		
		Запрос = ДокументОбъект.ПолучитьКоличествоДляРазблокировки(Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Возврат Выборка.Количество();	
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьПричинуБлокировки(Команда)
		
	Если Объект.Проведен Тогда
		КоличествоРазблокировки = КоличествоРазблокировки();
		
		Если КоличествоРазблокировки > 0 Тогда
			ОткрытьФорму("Документ.БлокировкаДвиженияТоваров.Форма.ФормаИзмененияПричины",Новый Структура("ДокументБлокировки",Объект.Ссылка),ЭтаФорма);
			
		Иначе
			Сообщить("Документ уже полностью разблокирован");
		КонецЕсли;
	Иначе
		Сообщить("Сначала необходимо провести документ!");
	КонецЕсли;
		

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	Если КопированиеСтрокКлиент.ВозможноКопированиеСтрок(Элементы.Товары.ТекущаяСтрока) Тогда
		СкопироватьСтрокиНаСервере();
		КопированиеСтрокКлиент.ОповеститьПользователяОКопированииСтрок(Элементы.Товары.ВыделенныеСтроки.Количество());
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СкопироватьСтрокиНаСервере()
	
	КопированиеСтрокСервер.ПоместитьВыделенныеСтрокиВБуферОбмена(Элементы.Товары.ВыделенныеСтроки, Объект.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	
	КоличествоТоваровДоВставки = Объект.Товары.Количество();
	
	ПолучитьСтрокиИзБуфераОбмена();
	
	КоличествоВставленных = Объект.Товары.Количество()- КоличествоТоваровДоВставки;
	КопированиеСтрокКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтрокиИзБуфераОбмена()
	
	ТаблицаДанных = КопированиеСтрокСервер.ПолучитьСтрокиИзБуфераОбмена();
	
	Для каждого Строка Из ТаблицаДанных Цикл	
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Строка);			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_Альтерра(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НастройкиТаблицы",СтруктураТаблицы());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция СтруктураТаблицы()
	
	СтруктураТаблицы = Новый Структура();
	
	СтруктураТаблицы.Вставить("Код", "строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура", "СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Характеристика", "Строка#Характеристика#20");
	СтруктураТаблицы.Вставить("КоличествоУпаковок", "Число#Количество#15");

	Возврат СтруктураТаблицы; 
	
КонецФункции 

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)
	
	Если Не Результат = Неопределено Тогда
		ТаблицаДанных = ПолучитьИзВременногоХранилища(Результат);
		
		Если ТаблицаДанных <> Неопределено Тогда
			Объект.Товары.Загрузить(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПодОстатокПриИзменении(Элемент)
	
	ТС = Элементы.Товары.ТекущиеДанные;
	Если ТС.ПодОстаток Тогда
		ТС.КоличествоУпаковок = ПолучитьОстатки(ТС.Номенклатура, ТС.Характеристика, Объект.Склад);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстатки(Номенклатура, ХарактеристикаНоменклатуры, Склад)

	Запрос = Новый Запрос;
//	Если ОбеспечениеВДокументахСервер.ЭтоПроизводительныйРежим() Тогда 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапасыИПотребностиОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад) КАК ЗапасыИПотребностиОстатки";
		
   // иначе
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	РаспределениеЗапасов.ВНаличии КАК ВНаличииОстаток
//	|ИЗ
//	|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов	
//	|ГДЕ
//	|	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)  
//	|	И РаспределениеЗапасов.Номенклатура = &Номенклатура
//	|	И РаспределениеЗапасов.Характеристика = &Характеристика
//	|	И РаспределениеЗапасов.Склад = &Склад";
//	конецесли;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Склад", Склад);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВНаличииОстаток;
	иначе
		возврат 0;
	КонецЕсли;
	
КонецФункции
